'''
자료와 처리

프로그래밍은 자료와 처리 두가지로 표현할 수 있습니다.
지금도 우리 주변에서는 자연스럽게 자료가 생성되고 처리되고 있습니다.

(예시)
- 수강생들이 제출하는 과제는 자료이고, 제출 여부를 확인하는 과정을 처리라고 합니다.
- 생일인 친구에게 보내는 축하 메세지는 자료이고, 이 메세지를 전송하는 또는 전달하는 행위는 처리라고 할 수 있습니다.

자료들이 다 성격이 다르다.
자료형(자료)
- string(문자형) : "반가워", "빨리 취직하고 싶다면 오즈코딩", '안녕하세요' "", '' 안에 있는건 문자로 인식
    - 메세지, 광고 문고
- number(숫자형) : 1,2,3,4,5,6,7,8,9,10
    - 나이, 매출, 전화번호, 주민등록번호
- boolean(불) : True, False
    - 게임 접속 여부

, end='' 아래 숫자를 옆으로 나열 할 수 있는 방법

sep는 구분자를 뜻한다. 구분에 원하는 기호를 넣을 수 있음
- separate의 약자입니다.

print(3, 6, 9, sep='\n')

print('369')
한칸씩 출력되게 하려면 print(3\n6\n9\n)
'''